integration-engineers-workshop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>integration-engineers-workshop</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="integration-engineers-workshop"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-16T09:35+0530"/>
<meta name="author" content="travula"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">integration-engineers-workshop</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 An overview of the workshop on Lab Integration, September [16,17,18,19,20] 2014</a>
<ul>
<li><a href="#sec-1-1">1.1 Program Listing for each session.</a></li>
<li><a href="#sec-1-2">1.2 Back-end preperation for the workshop</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> An overview of the workshop on Lab Integration, September [16,17,18,19,20] 2014</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Program Listing for each session.</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li>Each session will have primary presenters who will present or
</li>
</ul>

<p>  run the session. They will be assisted by facilitators who will help
  the engineers, pitch in with explanations, respond to queries/help
  during the session.
</p>
<ul>
<li>Facilitators will also document the key issues, findings, or
</li>
</ul>

<p>  learning of each session.
</p>
<ul>
<li>Sessions should encourage participants to perform hands­on exercises
</li>
</ul>

<p>  and activities using their labs.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Day #: Program Name</th><th scope="col" class="left">Session Timing</th><th scope="col" class="left">Name of the Session</th><th scope="col" class="left">Presenters</th><th scope="col" class="left">Facilitators</th><th scope="col" class="left">Comments</th></tr>
</thead>
<tbody>
<tr><td class="left">Day 01:</td><td class="left">09:00 AM - 09:45 AM</td><td class="left">Registrations of participants.</td><td class="left"></td><td class="left"></td><td class="left">Participants will be seated,</td></tr>
<tr><td class="left">Introduction and</td><td class="left"></td><td class="left">Workshop Inaugration</td><td class="left">Prof Nori</td><td class="left"></td><td class="left">and will sign an attendance sheet</td></tr>
<tr><td class="left">Know your repo</td><td class="left"></td><td class="left">Welcome address</td><td class="left">Dr Venkatesh</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">on GitHub</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">09:30 AM - 10:45 AM</td><td class="left">Why this Workshop?</td><td class="left">Thirumal</td><td class="left">Geeta</td><td class="left">Setting the Context for workshop,</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Goals,</td><td class="left"></td><td class="left"></td><td class="left">Stating the deliverables</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Day-wise Outline,</td><td class="left"></td><td class="left"></td><td class="left">from the workshop, Managing expectations of the engineers</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Expectations</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">10:45 AM - 11:00 AM</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">11:00 AM - 01:00 PM</td><td class="left">How to version control with git &amp; Github basics</td><td class="left">Prakash</td><td class="left">Soumay</td><td class="left">Create repos.</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Amulya</td><td class="left">Anon</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">01:00 PM - 02:00 PM</td><td class="left">Lunch Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">02:00 Pm - 03:30 PM</td><td class="left">Practise Session: Locate your lab source</td><td class="left">Prakash</td><td class="left">Jayanth</td><td class="left">Push Code,</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Clone a Repository</td><td class="left">Amulya</td><td class="left">Anon</td><td class="left">documentation etc</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Push the lab source</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:30 PM - 03:45 PM</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:45 PM - 05:00 PM</td><td class="left">OpenVZ:</td><td class="left">Jayanth</td><td class="left">Ishan</td><td class="left">This session introduces</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Introduction</td><td class="left">Yogesh</td><td class="left"></td><td class="left">participants to OpenVZ,</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Installation</td><td class="left"></td><td class="left"></td><td class="left">Post this participants will</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">start the virtualization process</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">on their system <a href="https://docs.google.com/presentation/d/1R8wxlZeMqNc8S1Z3vO7TfogM_2g5adCjEGEN8d1wlcQ/edit?usp=sharing">Document for presentation</a></td></tr>
<tr><td class="left">Day 1</td><td class="left"></td><td class="left">Ensure all the lab sources</td><td class="left">Jayanth</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">Assignment</td><td class="left"></td><td class="left">brought to the workshop are</td><td class="left">Anon</td><td class="left"></td><td class="left">At the end of the day</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">version controlled</td><td class="left"></td><td class="left"></td><td class="left">lab source should be</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">version controlled on github.</td></tr>
</tbody>
<tbody>
<tr><td class="left">Day 02: What it</td><td class="left">09:30 AM - 10:15 AM</td><td class="left">Introduction to Integration and</td><td class="left">Thirumal</td><td class="left">Prakash</td><td class="left">Introduction to integration levels,</td></tr>
<tr><td class="left">takes to</td><td class="left"></td><td class="left">Auto-deployment</td><td class="left"></td><td class="left">Amulya</td><td class="left">Merits of auto deployment and</td></tr>
<tr><td class="left">deploy a lab</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">centralized hosting</td></tr>
<tr><td class="left"></td><td class="left">10:15 AM - 10:45 AM</td><td class="left">Review the assignment 1</td><td class="left">Jayanth</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Anon</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">10:45 AM - 11:00 Am</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">11:00 AM - 01:00 PM</td><td class="left">Installation of OVPL</td><td class="left">Prakash</td><td class="left">Anon</td><td class="left">Demo + lab deployment by participants</td></tr>
<tr><td class="left"></td><td class="left">01:00 AM - 02:00 PM</td><td class="left">Lunch Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">02:00 PM - 03:30 PM</td><td class="left">Lab deployment continued</td><td class="left">Prakash</td><td class="left">Anon</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Amulya</td><td class="left">Soumya</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:30 PM - 03:45 PM</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:45 PM - 05:00 PM</td><td class="left">Lab deployment continued</td><td class="left">Prakash</td><td class="left">Anon</td><td class="left">At the end of the day,</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Amulya</td><td class="left">Soumya</td><td class="left">- deployment specification</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">for a lab has to developed.</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">- a lab has to be auto</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">deployed in a container</td></tr>
</tbody>
<tbody>
<tr><td class="left">Day 03:</td><td class="left">09:30 AM - 10:45 AM</td><td class="left">Introducing UI toolkit 1.0</td><td class="left">Soujanya</td><td class="left">Ambika</td><td class="left">Objective is to move unstructured labs to</td></tr>
<tr><td class="left">Standardization</td><td class="left"></td><td class="left"></td><td class="left">Madhavi</td><td class="left">Khushpreet</td><td class="left">structured UI 1.0 format.</td></tr>
<tr><td class="left">of labs</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Vani</td><td class="left">Labs that are already on Amrita can use</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">automated script to move to UI 1.0</td></tr>
<tr><td class="left"></td><td class="left">10:45 AM - 11:00 AM</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">11:00 AM - 1.00 PM</td><td class="left">Make an experiment</td><td class="left">Ambika</td><td class="left">Soujanya</td><td class="left">Hands-on-session</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">in a lab to be</td><td class="left">Madhavi</td><td class="left">Vani</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">UI 1.0  complaint</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">01:00 PM - 02:00 PM</td><td class="left">Lunch Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">02:00 PM - 03:30 PM</td><td class="left">Extracting a lab</td><td class="left">Soujanya</td><td class="left">Vani</td><td class="left">Hands-on-session</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">from Amritha and</td><td class="left">Khuspreet</td><td class="left">Ambika</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">making it UI 1.0</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">compliant</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:30 PM - 03:45 PM</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:45 PM - 05:00 PM</td><td class="left">Work on the</td><td class="left">Madhavi</td><td class="left">Ambika</td><td class="left">Hands-on-session</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">earlier experiment</td><td class="left">Khuspreet</td><td class="left">Vani</td><td class="left">At the end of the day,</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">to make to UI 1.0</td><td class="left">Soujanya</td><td class="left"></td><td class="left">- an experiment in a lab</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">compliant</td><td class="left"></td><td class="left"></td><td class="left">has to be UI1.0 compliant.</td></tr>
</tbody>
<tbody>
<tr><td class="left">Day 04:</td><td class="left">9:30 till</td><td class="left">Work on more experiments</td><td class="left">Ambika</td><td class="left">Aon</td><td class="left">At the end of the day,</td></tr>
<tr><td class="left">Repeat of Day 02</td><td class="left">end of day</td><td class="left">and make them UI 1.0 compliant</td><td class="left">Soujanya</td><td class="left">Prakash</td><td class="left">- all experiments in a lab</td></tr>
<tr><td class="left">and Day 03</td><td class="left"></td><td class="left"></td><td class="left">Amulya</td><td class="left">Ambika</td><td class="left">should be UI 1.0 compliant.</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Use the auto deployment mechanism</td><td class="left">Soumya</td><td class="left"></td><td class="left">- deployment spec for another lab</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">to test the changes.</td><td class="left"></td><td class="left"></td><td class="left">should be developed.</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">Iterate this process</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">for another Lab</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Day 05: Security</td><td class="left">09:30 AM - 10:45 Am</td><td class="left">Web application security</td><td class="left">Ishan Sharma</td><td class="left">Jayanth</td><td class="left">Explanation of various web venerabilities</td></tr>
<tr><td class="left">and Performance</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Yogesh</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">10:45 AM - 11:00 AM</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">11:00 AM - 01:00 PM</td><td class="left">Automating</td><td class="left">Ishan Sharma</td><td class="left">Jayanth</td><td class="left">Tool Demo</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">web applcation</td><td class="left"></td><td class="left">Yogesh</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">security</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">01:00 PM - 02:00 PM</td><td class="left">Lunch Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">02:00 PM - 03:30 PM</td><td class="left">Critical rendering path</td><td class="left">Jatin Agarwal</td><td class="left">Soujanya</td><td class="left">Basic understanding of how does a</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">and optimization</td><td class="left"></td><td class="left">Jayanth</td><td class="left">web page work and best practice</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Madhavi</td><td class="left">for developing an web application</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Ambika</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:30 PM - 03:45 PM</td><td class="left">Tea Break</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">03:45 PM - 05:00 PM</td><td class="left">Tools for measuring</td><td class="left">Jatin Agarwal</td><td class="left">Soujanya</td><td class="left">Hands on session on how to</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">performance</td><td class="left">Nurendra Choudhary</td><td class="left">Jayanth</td><td class="left">use YSlow, Pagespeed and Webpagetest</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Madhavi</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">AMbika</td><td class="left"></td></tr>
</tbody>
</table>




</div>

</div>
