integration-engineers-workshop.org
** Back-end preperation for the workshop 
|---------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------+-----------------------------------------------------------------------+---------|
| Activities                                                                                                    | Team responsibility                                                                                                                                                                                  | Point of Contacts                          | Location of workshop material                                         | Comment |
|---------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------+-----------------------------------------------------------------------+---------|
| Ensure IIIT-H servers hosting our labs are up and running all through the workshop duration                   | Ishan, Jayanth, Yogesh,Saikrishna, Soumya and Saurabh                                                                                                                                                | Ishan, Anon                                | Provide necessary access & permissions to team members managing this. |         |
| Internet & Systems                                                                                            | Yogesh & Saikrishna                                                                                                                                                                                  |                                            |                                                                       |         |
| Workshop presentation slides, activities & assignments                                                        | Jayanth & Yogesh (for  OpenVZ), Prakash & Amulya (for OVPL), Thirumal (for Integration Levels), Ishan (for Security), Jatin (for Performance), Ambika, Kushpreet,Soujanya & Madhavi (for UI Toolkit) |                                            | https://github.com/VirtualÂ­Labs/EventsÂ­MeetingsLabs/EventsÂ­Meetings   |         |
| a. Lab Integration Kit, b. Documentation, c. Sources, d. Tools etc                                            | Prakash & Amulya (for OVPL), Ishan (for Security), Jatin (for Performance)                                                                                                                           |                                            | https://github.com/VirtualÂ­Labs/labÂ­integrationÂ­kit                   |         |
| REcording of Wrokshop                                                                                         | Geeta                                                                                                                                                                                                | Geeta                                      |                                                                       |         |
| a. Keeping 5 systems ready on standby  b. LAN/Wi-Fi, c. System configuration, d. BackÂ­end servers & systems   | Systems team                                                                                                                                                                                         | Ishan, Saikrishna, Yogesh, Jayanth, Soumya |                                                                       |         |
| a. Accommodation & meals of participants, b. Getting the VLEAD conference room ready, c. Whiteboard/Projector | Pushpalatha                                                                                                                                                                                          |                                            |                                                                       |         |
|---------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------+-----------------------------------------------------------------------+---------|
