integration-engineers-workshop.html

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Back-end preperation for the workshop</h3>
<div class="outline-text-3" id="text-1-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Activities</th><th scope="col" class="left">Team responsibility</th><th scope="col" class="left">Point of Contacts</th><th scope="col" class="left">Location of workshop material</th><th scope="col" class="left">Comment</th></tr>
</thead>
<tbody>
<tr><td class="left">Ensure IIIT-H servers hosting our labs are up and running all through the workshop duration</td><td class="left">Ishan, Jayanth, Yogesh,Saikrishna, Soumya and Saurabh</td><td class="left">Ishan, Anon</td><td class="left">Provide necessary access &amp; permissions to team members managing this.</td><td class="left"></td></tr>
<tr><td class="left">Internet &amp; Systems</td><td class="left">Yogesh &amp; Saikrishna</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">Workshop presentation slides, activities &amp; assignments</td><td class="left">Jayanth &amp; Yogesh (for  OpenVZ), Prakash &amp; Amulya (for OVPL), Thirumal (for Integration Levels), Ishan (for Security), Jatin (for Performance), Ambika, Kushpreet,Soujanya &amp; Madhavi (for UI Toolkit)</td><td class="left"></td><td class="left"><a href="https://github.com/VirtualÂ­Labs/EventsÂ­MeetingsLabs/EventsÂ­Meetings">https://github.com/VirtualÂ­Labs/EventsÂ­MeetingsLabs/EventsÂ­Meetings</a></td><td class="left"></td></tr>
<tr><td class="left">a. Lab Integration Kit, b. Documentation, c. Sources, d. Tools etc</td><td class="left">Prakash &amp; Amulya (for OVPL), Ishan (for Security), Jatin (for Performance)</td><td class="left"></td><td class="left"><a href="https://github.com/VirtualÂ­Labs/labÂ­integrationÂ­kit">https://github.com/VirtualÂ­Labs/labÂ­integrationÂ­kit</a></td><td class="left"></td></tr>
<tr><td class="left">REcording of Wrokshop</td><td class="left">Geeta</td><td class="left">Geeta</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">a. Keeping 5 systems ready on standby  b. LAN/Wi-Fi, c. System configuration, d. BackÂ­end servers &amp; systems</td><td class="left">Systems team</td><td class="left">Ishan, Saikrishna, Yogesh, Jayanth, Soumya</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">a. Accommodation &amp; meals of participants, b. Getting the VLEAD conference room ready, c. Whiteboard/Projector</td><td class="left">Pushpalatha</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-16T09:35+0530</p>
<p class="author">Author: travula</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
